#Использовать ".."

&Тест
Процедура ЗапускКонтейнераGrafanaOtelLgtm() Экспорт

	Образ = "grafana/otel-lgtm";

	КонтейнерGrafana = Новый ОбщийКонтейнер(Образ)
		.ОткрытьПорт(3000);

	КонтейнерGrafana.Запустить();

	Адрес = "http://localhost";
	Порт = КонтейнерGrafana.ПолучитьОткрытыйПорт(3000);

	// Ждём пока сервисы внутри контейнера запустятся
	Приостановить(10000);

	HttpСоединение = Новый HTTPСоединение(Адрес, Порт, , , , 30);
	HttpЗапрос = Новый HTTPЗапрос;
	HttpЗапрос.АдресРесурса = "/api/health";
	Ответ = HttpСоединение.Получить(HttpЗапрос);

	Если Ответ.КодСостояния <> 200 Тогда
		ВызватьИсключение "Ожидался код состояния 200, получен " + Ответ.КодСостояния;
	КонецЕсли;

	КонтейнерGrafana.Остановить();

КонецПроцедуры
