#Использовать ".."

&Тест
Процедура ЗапускКонтейнераHttpBin() Экспорт
	
	Образ = "kennethreitz/httpbin";

	КонтейнерHttpBin = Новый ОбщийКонтейнер(Образ)
		.ОткрытьПорт(80);

	КонтейнерHttpBin.Запустить();

	Адрес = "http://localhost";
	Порт = КонтейнерHttpBin.ПолучитьОткрытыйПорт(80);
	
	HttpСоединение = Новый HTTPСоединение(Адрес, Порт, , , , 10);
	HttpЗапрос = Новый HTTPЗапрос;
	HttpЗапрос.АдресРесурса = "/get";
	Ответ = HttpСоединение.Получить(HttpЗапрос);

	Если Ответ.КодСостояния <> 200 Тогда
		ВызватьИсключение "Ожидался код состояния 200, получен " + Ответ.КодСостояния;
	КонецЕсли;

	КонтейнерHttpBin.Остановить();

КонецПроцедуры
